void setup(){
  size(500,500); 
}
int [][] go ={
  {0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0}
};//陣列array 9x9
int N=0;
void mousePressed(){
  int j = (mouseX-25)/50;
  int i = (mouseY-25)/50;
  go[i][j] = (N%2==0) ? 1 : 2;
  N++;
}
void draw(){ //用迴圈,來畫出很多棋
  background(246,194,108);
  for(int i=0; i<=9 ;i++){//左手i 對應y座標
    line(50,50*i,450,50*i);
    line(50*i,50,50*i,450);
  }
  for(int i=0; i<9 ;i++){
    for(int j=0 ; j<9 ; j++){//右手j 對應x座標
      if(go[i][j]==1){
        fill(0);//1黑棋
        ellipse(50+j*50,50+i*50 ,40,40);
      }else if( go[i][j]==2 ){ 
        fill(255);
        ellipse(50+j*50,50+i*50 ,40,40);
      }
    }
  }
}
